Documents/Проект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Проект</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РеализацияРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПроекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Трудоемкость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Проект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РеализацияРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>РеализацияРабот</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Проект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыПроекта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Проект/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПроектСогласованНаСервере()
	Объект.СтатусПроекта = Перечисления.СтатусыПроекта.ВРаботе;
	Элементы.ФормаПроектСогласован.Доступность = Ложь;
	Если РольДоступна("Администратор") Тогда
		Элементы.Услуги.Доступность = Истина;
	Иначе
	    Элементы.Услуги.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроектСогласован(Команда)
	ПроектСогласованНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	//Проверка оплат
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДенежныеСредства.Проект КАК Проект,
		|	ДенежныеСредства.Сумма КАК Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства";
	
	Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	Объект.Оплачено = 0;
	
	Для каждого СтрокаОплаты из ВыборкаДетальныеЗаписи Цикл
		Если СтрокаОплаты.Проект = Объект.Ссылка Тогда
			Объект.Оплачено = Объект.Оплачено + СтрокаОплаты.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.Сумма > Объект.Оплачено Тогда
		Разность = Объект.Сумма - Объект.Оплачено;
		Элементы.ДолженНам.Заголовок = "Должен нам " + Разность + " руб.";	
		Элементы.ДолженНам.ЦветТекста = WebЦвета.Красный;
	ИначеЕсли Объект.Сумма = Объект.Оплачено Тогда
		Элементы.ДолженНам.Заголовок = "Полностью оплатил проект.";
		Элементы.ДолженНам.ЦветТекста = WebЦвета.Зеленый;
	ИначеЕсли Объект.Сумма < Объект.Оплачено Тогда
		Разность = Объект.Оплачено - Объект.Сумма;
		Элементы.ДолженНам.Заголовок = "Переплатил " + Разность + " руб.";	
		Элементы.ДолженНам.ЦветТекста = WebЦвета.Оранжевый;
	КонецЕсли;
		
	Если Объект.Оплачено > 0 Тогда
		Объект.СтатусОплаты = Перечисления.СтатусыОплаты.ЧастичноОплачен;
	КонецЕсли;
	
	Если Объект.Оплачено >= Объект.Сумма Тогда
		Объект.СтатусОплаты = Перечисления.СтатусыОплаты.Оплачен;
	КонецЕсли;
	
	Если Объект.Оплачено = 0 Тогда
		Объект.СтатусОплаты = Перечисления.СтатусыОплаты.НеОплачен;
	КонецЕсли;

	
	//Статус меняется на завершен, если задачи все закрыты, добавляется возможность закрыть проект	
	Если Объект.СтатусПроекта.Пустая() Тогда
		Объект.СтатусПроекта = Перечисления.СтатусыПроекта.НаСогласовании;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияРаботОстатки.Номенклатура КАК Номенклатура,
		|	РеализацияРаботОстатки.ЧасыОстаток КАК ЧасыОстаток
		|ИЗ
		|	РегистрНакопления.РеализацияРабот.Остатки(, Проект = &Проект) КАК РеализацияРаботОстатки";
	
	Запрос.УстановитьПараметр("Проект", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Объект.СтатусПроекта = Перечисления.СтатусыПроекта.ВРаботе Тогда
		Если РезультатЗапроса.Пустой() Тогда
			Объект.СтатусПроекта = Перечисления.СтатусыПроекта.Завершен;
			Элементы.ФормаЗакрытьПроект.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	
	
	Если Объект.СтатусПроекта = Перечисления.СтатусыПроекта.НаСогласовании Тогда
		Элементы.ФормаПроектСогласован.Доступность = Истина;
		Элементы.Услуги.Доступность = Истина;
	ИначеЕсли Объект.СтатусПроекта = Перечисления.СтатусыПроекта.Завершен Тогда
		Элементы.ФормаЗакрытьПроект.Доступность = Истина;
	ИначеЕсли Объект.СтатусПроекта = Перечисления.СтатусыПроекта.Закрыт Тогда	
		Если РольДоступна("Администратор") Тогда
			ЭтаФорма.Доступность = Истина;
			Элементы.Услуги.Доступность = Истина;
		Иначе
		    ЭтаФорма.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если РольДоступна("Администратор") Тогда
		ЭтаФорма.Доступность = Истина;
		Элементы.Услуги.Доступность = Истина;
		Элементы.СтатусОплаты.Доступность = Истина;
		Элементы.СтатусПроекта.Доступность = Истина;
	КонецЕсли;		
	
	Если Объект.Сумма = 0 Тогда
		Элементы.ДолженНам.Видимость = Ложь;		
	КонецЕсли;
	
	ОбновитьНаСервере();
	
	КонецПроцедуры

&НаСервере
Функция УслугиНоменклатураПриИзмененииНаСервере(Номенклатура)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Цена = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Цена = ВыборкаДетальныеЗаписи.Цена;	
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат Цена;	
КонецФункции

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;	
	Цена =	УслугиНоменклатураПриИзмененииНаСервере(ТекСтрока.Номенклатура);
	ТекСтрока.Цена = Цена;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Трудоемкость;
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиТрудоемкостьПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Трудоемкость;
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Трудоемкость;
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	ТекСтрока = ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Цена = ТекСтрока.Сумма / ТекСтрока.Трудоемкость;
	Объект.Сумма = Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПроектНаСервере()
	Если Объект.СтатусОплаты = Перечисления.СтатусыОплаты.Оплачен Тогда
		Объект.СтатусПроекта = Перечисления.СтатусыПроекта.Закрыт;
	Иначе
		Сообщить("Невозможно закрыть проект. Проект не оплачен.");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПроект(Команда)
	ЗакрытьПроектНаСервере();
КонецПроцедуры

&НаСервере
Процедура АнализСроковНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура АнализСроков(Команда)
	АнализСроковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ДиаграммаГанта.Очистить();
	Для каждого СтрокаУслуги из Объект.Услуги Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(СтрокаУслуги.Номенклатура);
		Серия = ДиаграммаГанта.УстановитьСерию(0);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		ДиаграммаГанта.ОтображатьЛегенду = Ложь;
		
		Интервал = Значение.Добавить();
		СвязьИнтервалНачало = Интервал; 
		Интервал.Начало = СтрокаУслуги.ДатаНачала;
		Интервал.Конец = СтрокаУслуги.ДатаОкончания;				
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УслугиДатаНачалаПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УслугиДатаОкончанияПриИзменении(Элемент)
	ОбновитьНаСервере();              
КонецПроцедуры
